# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'stripe/stripe-cli'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'xclip' # terminal copy
brew 'zoxide'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'node'
brew 'yarn'

# Apps
# cask '1password'
cask 'caffeine'
cask 'discord'
cask 'figma'
cask 'github'
cask 'helo'
cask 'imageoptim'
cask 'insomnia'
cask 'pastebot'
cask 'readdle-spark'
cask 'screenflow'
cask 'slack'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmit'
cask 'tunnelbear'
cask 'tuple'
cask 'visual-studio-code'
cask 'zoom'
cask 'jordanbaird-ice'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Speedtest', id: 1153157709
mas 'Spark', id: 1176895641
