# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'stripe/stripe-cli'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'yq'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'xclip' # terminal copy
brew 'zoxide'

# Development
brew 'node'
brew 'yarn'

# Apps
cask 'caffeine'
cask 'insomnia'
cask 'tableplus'
cask 'telegram-desktop'
cask 'transmit'
cask 'visual-studio-code'
cask 'zoom'
cask 'warp'

# Quicklook
cask 'qlmarkdown'
# cask 'quicklook-json'
cask 'syntax-highlight'
cask 'qlvideo'
cask 'qlimagesize'
cask 'mdimagesizemdimporter'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-hack-nerd-font'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Spark', id: 1176895641
mas 'Speedtest', id: 1153157709
mas 'Bitwarden', id: 1352778147
